#coding: utf-8
#Задача №1
x = int(input("Введите x = "))
y = 7 * x + 5
print("y = " , y)

#Задача №2
a = int(input("Введите a = "))
P = 4 * a
print("P = " , P)

#Задача №3
r = int(input("Введите r = "))
p = 3.14
L = 2 * p * r
print("L = " , L)

#Задача №4
d = int(input("Введите d = "))
p = 3.14
S = 1/4 * d ** 2 * p
print("S = " , S)

#Задача №5
a = int(input("Введите a = "))
b = int(input("Введите b = "))
c = (a ** 2 + b ** 2) ** 0.5
print("c = " , c)
