#coding: utf-8

#Задача№9
x=int (input("Введите число:"))
a=int (input("Введите число:"))
if x<1:
   y=a ** 2 + x ** 2
   print (y)
else:
    y=a ** 2 - x ** 2
    print (y)
    